[BestFriendsForever.BuckUp SkillDefinition]
SkillDescription="[skill]Deathtrap Ability[-skill].  Deathtrap [skill]restores the shields[-skill] of one ally to full."

[BestFriendsForever.BuckUp:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Deathtrap restores $NUMBER$ of an ally's shield."

[BestFriendsForever.CookingUpTrouble SkillDefinition]
SkillDescription="While your gun's [skill]Magazine[-skill] is full you [skill]regenerate health[-skill]."

[BestFriendsForever.CookingUpTrouble:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Regenerates $NUMBER$ of your Max Health / sec."

[BestFriendsForever.ExplosiveClap SkillDefinition]
SkillDescription="[skill]Deathtrap Ability[-skill].  Deathtrap creates an explosive blast with his robo-hands, dealing [skill]Explosive Damage[-skill] to all nearby enemies."

[BestFriendsForever.ExplosiveClap:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="''This clap will trap your soul! Er... explode your body... whatever.''"

[BestFriendsForever.FancyMathematics SkillDefinition]
SkillDescription="Improves [skill]Shield Recharge Delay[-skill] and [skill]Shield Recharge Rate[-skill] based on how low your [skill]health[-skill] is.  The lower your [skill]health[-skill], the greater the bonuses."

[BestFriendsForever.MadeOfSternerStuff SkillDefinition]
SkillDescription="You and [skill]Deathtrap[-skill] take [skill]reduced damage[-skill] from [skill]all sources[-skill].  Additionally, Deathtrap gains increased [skill]Melee Damage[-skill]."

[BestFriendsForever.SharingIsCaring SkillDefinition]
SkillDescription="Grants a copy of your [skill]shield[-skill] to [skill]Deathtrap[-skill], complete with all the bonuses and benefits your shield provides."

[BestFriendsForever.SharingIsCaring:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="''Thousands of candles can be lit from a single candle, and the life of the candle will not be shortened.''"

[BestFriendsForever.TheBetterHalf SkillDefinition]
SkillDescription="When your [skill]Magazine[-skill] is past half-empty, you gain increased [skill]Fire Rate[-skill]."

[BestFriendsForever.UnstoppableForce SkillDefinition]
SkillDescription="[skill]Kill Skill[-skill].  Killing an enemy grants you bonus [skill]Movement Speed[-skill] and causes your [skill]shield to regenerate[-skill] for a short while."

[BestFriendsForever.UnstoppableForce:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Regenerates $NUMBER$ of your Max Shields / sec."

[BestFriendsForever.UpshotRobot SkillDefinition]
SkillDescription="While [skill]Deathtrap[-skill] is active, kills made by [skill]Deathtrap[-skill] or yourself increase [skill]Deathtrap's Duration[-skill] and grant both of you a stacking [skill]Melee Damage[-skill] bonus.  Bonuses are lost when [skill]Deathtrap[-skill] goes away."

[BestFriendsForever.UpshotRobot:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Killing an enemy adds $NUMBER$ seconds to Deathtrap's duration."

[BestFriendsForever.UpshotRobot:AttributePresentationDefinition_5 AttributePresentationDefinition]
Description="Melee Damage: $NUMBER$ per stack"

[EmbraceChaos.Anarchy SkillDefinition]
SkillDescription="Killing an enemy or fully emptying your gun's [skill]Magazine[-skill] while in combat grants you a stack of [skill]Anarchy[-skill].  Each stack of [skill]Anarchy[-skill] increases [skill]Gun Damage[-skill] while decreasing [skill]Accuracy[-skill].  Prematurely reloading your gun causes you to lose all stacks of [skill]Anarchy[-skill].  [skill]Anarchy[-skill] stacks are quickly lost while in [skill]Fight for your Life[-skill]."

[EmbraceChaos.Anarchy:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Gun Damage: $NUMBER$ per stack"

[EmbraceChaos.Anarchy:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Max Anarchy Stacks: $NUMBER$"

[EmbraceChaos.Anarchy:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Accuracy: $NUMBER$ per stack"

[EmbraceChaos.BloodSoakedShields SkillDefinition]
SkillDescription="Killing an enemy immediately restores a portion of your [skill]shields[-skill], but you lose a portion of your [skill]health[-skill]."

[EmbraceChaos.BloodSoakedShields:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Restores $NUMBER$ of your shield."

[EmbraceChaos.BloodSoakedShields:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Lose $NUMBER$ of your current health."

[EmbraceChaos.DeathFromAbove SkillDefinition]
SkillDescription="Shooting an enemy while in mid-air consumes [skill]Anarchy[-skill] stacks and causes a [skill]Digi-splosion[-skill], damaging nearby enemies."

[EmbraceChaos.DeathFromAbove:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Rank $NUMBER$ Damage"

[EmbraceChaos.DeathFromAbove:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Anarchy Stacks Consumed: $NUMBER$"

[EmbraceChaos.Discord SkillDefinition]
SkillDescription="Prematurely reloading activates [skill]Discord[-skill], increasing [skill]Accuracy[-skill], [skill]Fire Rate[-skill], and [skill]Health Regeneration[-skill].  You constantly lose [skill]Anarchy[-skill] stacks while [skill]Discord[-skill] is active.  [skill]Discord[-skill] can be deactivated by prematurely reloading again."

[EmbraceChaos.Discord:AttributePresentationDefinition_6 AttributePresentationDefinition]
Description="Regenerates $NUMBER$ of your Max Health / sec."

[EmbraceChaos.ImmovableObject SkillDefinition]
SkillDescription="[skill]Kill Skill[-skill].  Killing an enemy increases [skill]Gun Damage[-skill] and [skill]regenerates health[-skill] for a short while, but your [skill]Movement Speed[-skill] is also reduced."

[EmbraceChaos.ImmovableObject:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Regenerates $NUMBER$ of your Max Health / sec."

[EmbraceChaos.PreshrunkCyberpunk:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Max Anarchy Stacks: $NUMBER$"

[EmbraceChaos.RationalAnarchist SkillDefinition]
SkillDescription="If you have 0 stacks of [skill]Anarchy[-skill], then the next time you would gain an [skill]Anarchy[-skill] stack you gain 25 instead."

[EmbraceChaos.RationalAnarchist:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Get 25 Anarchy stacks for the price of 1. It's no free lunch, but still."

[EmbraceChaos.RobotRampage:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="''If one attack is good, then seven should be elected Mayor.''"

[EmbraceChaos.TypecastIconoclast SkillDefinition]
SkillDescription="Whenever you gain a stack of [skill]Anarchy[-skill], there is a chance that you gain an additional stack."

[EmbraceChaos.WithClaws SkillDefinition]
SkillDescription="[skill]Melee Override Skill[-skill].  While you have a stack of [skill]Anarchy[-skill], press <StringAliasMap:Action.Melee> to [skill]digistruct claws[-skill] and swipe twice at an enemy, dealing damage based on the number of [skill]Anarchy[-skill] stacks you currently have and [skill]restoring health[-skill].  The lower your health, the more health you gain.  This attack consumes an [skill]Anarchy[-skill] stack."

[EmbraceChaos.WithClaws:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Melee Damage: $NUMBER$ per Anarchy stack"

[EmbraceChaos.WithClaws:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Converts $NUMBER$ of damage dealt to health."

[LittleBigTrouble.ElectricalBurn SkillDefinition]
SkillDescription="When your [skill]Electrocute Status Effects[-skill] deal damage to enemies, there is a chance they will [skill]burst into flames[-skill] and take [skill]Burn Damage[-skill].  The amount of [skill]Burn Damage[-skill] is based on the [skill]Electrocute[-skill] damage dealt."

[LittleBigTrouble.ElectricalBurn:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Electrical Burn Chance: $NUMBER$"

[LittleBigTrouble.EvilEnchantress:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Elemental Effect Damage: $NUMBER$"

[LittleBigTrouble.InterspersedOutburst SkillDefinition]
SkillDescription="Not shooting an enemy for a short time grants you a stack of [skill]Interspersed Outburst[-skill].  The next time you shoot an enemy, all stacks of [skill]Interspersed Outburst[-skill] are consumed and you deal bonus [skill]Slag Damage[-skill].  The more stacks consumed and the higher the skill rank, the greater the chance of slagging the target."

[LittleBigTrouble.InterspersedOutburst:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Interspersed Outburst Damage: Rank $NUMBER$"

[LittleBigTrouble.InterspersedOutburst:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Max Stacks: $NUMBER$"

[LittleBigTrouble.LightningStrike:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Enemy Astraphobia: $NUMBER$ "

[LittleBigTrouble.MakeItSparkle:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="''Robots are like vampires: they sparkle when hit with incendiary rounds.''"

[LittleBigTrouble.MorePep SkillDefinition]
SkillDescription="Increases your chances of applying [skill]Burn[-skill], [skill]Electrocute[-skill], [skill]Corrode[-skill], and [skill]Slag[-skill] status effects."

[LittleBigTrouble.MorePep:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Electrocute Chance: $NUMBER$"

[LittleBigTrouble.MorePep:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Ignite Chance: $NUMBER$"

[LittleBigTrouble.MorePep:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Corrode Chance: $NUMBER$"

[LittleBigTrouble.MorePep:AttributePresentationDefinition_3 AttributePresentationDefinition]
Description="Slag Chance: $NUMBER$"

[LittleBigTrouble.Myelin SkillDefinition]
SkillDescription="Increases [skill]Shock Damage Resistance[-skill] and [skill]Shield Capacity[-skill]."

[LittleBigTrouble.OneTwoBoom:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="$NUMBER$ more multi-kill!"

[LittleBigTrouble.ShockAndAAAGGGHHH SkillDefinition]
SkillName="Shock and ''AAAGGGGHHH!''"

[LittleBigTrouble.ShockAndAAAGGGHHH:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="''The trouble ain't that there is too many fools, but that the lightning ain't distributed right.''"

[LittleBigTrouble.ShockStorm SkillDefinition]
SkillDescription="Killing an enemy with a [skill]Critical Hit[-skill] causes an [skill]Electrical Storm[-skill], dealing [skill]Shock Damage[-skill] to nearby enemies.  [skill]Electrical Storms[-skill] are also caused by [skill]Deathtrap[-skill] whenever he kills an enemy."

[LittleBigTrouble.StrengthOfFiveGorillas:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Melee Damage: $NUMBER$"

[LittleBigTrouble.TheStare SkillDefinition]
SkillDescription="[skill]Deathtrap Ability[-skill].  Deathtrap fires a laser beam and sweeps it across the battlefield, dealing [skill]Incendiary Damage[-skill] and possibly [skill]igniting[-skill] enemies."

[LittleBigTrouble.TheStare:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="$NUMBER$ more degrees of fire. Also, lasers."

[LittleBigTrouble.WiresDontTalk:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Shock/Electrocute Damage: $NUMBER$"
